In [1]:
import numpy as np,pandas as pd

In [2]:
pd.Series?

Init signature:
pd.Series(
    data=None,
    index=None,
    dtype=None,
    name=None,
    copy=False,
    fastpath=False,
)
Docstring:
One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object
supports both integer- and label-based indexing and provides a host of
methods for performing operations involving the index. Statistical
methods from ndarray have been overridden to automatically exclude
missing data (currently represented as NaN).

Operations between Series (+, -, /, *, **) align values based on their
associated index values-- they need not be the same length. The result
index will be the sorted union of the two indexes.

Parameters
----------
data : array-like, Iterable, dict, or scalar value
    Contains data stored in Series.

    .. versionchanged:: 0.23.0
       If data is a dict, argument order is maintained for Python 3.6
       and later.

index : array-like or Index (1d)
    Values must be hashable and have the same length as `data`.
    Non-unique index values are allowed. Will default to
    RangeIndex (0, 1, 2, ..., n) if not provided. If both a dict and index
    sequence are used, the index will override the keys found in the
    dict.
dtype : str, numpy.dtype, or ExtensionDtype, optional
    Data type for the output Series. If not specified, this will be
    inferred from `data`.
    See the :ref:`user guide <basics.dtypes>` for more usages.
name : str, optional
    The name to give to the Series.
copy : bool, default False
    Copy input data.
File:           /usr/lib/python3/dist-packages/pandas/core/series.py
Type:           type
Subclasses:     SubclassedSeries

In [3]:
ser1=pd.Series([4,5,3,5,3],index=['A','B','C','D','E'],dtype='int32',name='kali')

In [4]:
ser1

A    4
B    5
C    3
D    5
E    3
Name: kali, dtype: int32

In [5]:
kali

NameError: name 'kali' is not defined

In [6]:
ser2=pd.Series([4,5,3,5,3],index=['A','B','C','D','E'],dtype='float32')

In [7]:
ser2

A    4.0
B    5.0
C    3.0
D    5.0
E    3.0
dtype: float32

In [8]:
d1={'one':34,'two':42,'three':67}
pd.Series(d1)

one      34
two      42
three    67
dtype: int64

In [9]:
ser1.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [10]:
ser.values

NameError: name 'ser' is not defined

In [11]:
ser1.values

array([4, 5, 3, 5, 3], dtype=int32)

In [12]:
ser1.value_counts(5)

5    0.4
3    0.4
4    0.2
Name: kali, dtype: float64

In [13]:
ser1.value_counts

<bound method IndexOpsMixin.value_counts of A    4
B    5
C    3
D    5
E    3
Name: kali, dtype: int32>

In [14]:
ser1.value_counts?

Signature:
ser1.value_counts(
    normalize=False,
    sort=True,
    ascending=False,
    bins=None,
    dropna=True,
)
Docstring:
Return a Series containing counts of unique values.

The resulting object will be in descending order so that the
first element is the most frequently-occurring element.
Excludes NA values by default.

Parameters
----------
normalize : bool, default False
    If True then the object returned will contain the relative
    frequencies of the unique values.
sort : bool, default True
    Sort by frequencies.
ascending : bool, default False
    Sort in ascending order.
bins : int, optional
    Rather than count values, group them into half-open bins,
    a convenience for ``pd.cut``, only works with numeric data.
dropna : bool, default True
    Don't include counts of NaN.

Returns
-------
Series

See Also
--------
Series.count: Number of non-NA elements in a Series.
DataFrame.count: Number of non-NA elements in a DataFrame.
DataFrame.value_counts: Equivalent method on DataFrames.

Examples
--------
>>> index = pd.Index([3, 1, 2, 3, 4, np.nan])
>>> index.value_counts()
3.0    2
4.0    1
2.0    1
1.0    1
dtype: int64

With `normalize` set to `True`, returns the relative frequency by
dividing all values by the sum of values.

>>> s = pd.Series([3, 1, 2, 3, 4, np.nan])
>>> s.value_counts(normalize=True)
3.0    0.4
4.0    0.2
2.0    0.2
1.0    0.2
dtype: float64

**bins**

Bins can be useful for going from a continuous variable to a
categorical variable; instead of counting unique
apparitions of values, divide the index in the specified
number of half-open bins.

>>> s.value_counts(bins=3)
(2.0, 3.0]      2
(0.996, 2.0]    2
(3.0, 4.0]      1
dtype: int64

**dropna**

With `dropna` set to `False` we can also see NaN index values.

>>> s.value_counts(dropna=False)
3.0    2
NaN    1
4.0    1
2.0    1
1.0    1
dtype: int64
File:      /usr/lib/python3/dist-packages/pandas/core/base.py
Type:      method

In [15]:
ser1.value_counts()

5    2
3    2
4    1
Name: kali, dtype: int64

In [16]:
ser1.append(33)

TypeError: cannot concatenate object of type '<class 'int'>'; only Series and DataFrame objs are valid

In [17]:
ser1.append[2]=4

TypeError: 'method' object does not support item assignment

In [19]:
ser1.cumsum()

A     4
B     9
C    12
D    17
E    20
Name: kali, dtype: int64

In [20]:
ser1

A    4
B    5
C    3
D    5
E    3
Name: kali, dtype: int32

In [21]:
ser1.duplicated()

A    False
B    False
C    False
D     True
E     True
Name: kali, dtype: bool

In [22]:
ser1.drop_duplicates()

A    4
B    5
C    3
Name: kali, dtype: int32

In [23]:
ser1

A    4
B    5
C    3
D    5
E    3
Name: kali, dtype: int32

In [24]:
ser1.drop_duplicates(inplace=True)

In [25]:
ser1

A    4
B    5
C    3
Name: kali, dtype: int32

In [26]:
ser1[0]

4

In [27]:
ser1['A']

4

In [28]:
ser1[0]=22

In [29]:
ser1

A    22
B     5
C     3
Name: kali, dtype: int32

In [30]:
pd.Series(np.array([4,3,5]))

0    4
1    3
2    5
dtype: int64

In [31]:
pd.Series(np.array([[1,4,2],[5,3,5]]))

Exception: Data must be 1-dimensional

In [32]:
ser1.isnull()

A    False
B    False
C    False
Name: kali, dtype: bool

In [33]:
ser1.notnull()

A    True
B    True
C    True
Name: kali, dtype: bool

In [34]:
ser1.isin([3])

A    False
B    False
C     True
Name: kali, dtype: bool

In [35]:
ser1.isin([5,3,2])

A    False
B     True
C     True
Name: kali, dtype: bool

In [36]:
ser1[ser1.isin([5,3,2])]

B    5
C    3
Name: kali, dtype: int32

In [37]:
ser1.index.names=[1,2,4]

ValueError: Length of new names must be 1, got 3

In [38]:
ser1

A    22
B     5
C     3
Name: kali, dtype: int32

In [40]:
ser1.index.name=[11,22,33]

TypeError: Index.name must be a hashable type

ser1.index=[11,22,33]

In [41]:
ser1

A    22
B     5
C     3
Name: kali, dtype: int32

In [42]:
ser.name

NameError: name 'ser' is not defined

In [43]:
ser1.name

'kali'

In [44]:
ser1

A    22
B     5
C     3
Name: kali, dtype: int32

In [45]:
ser1.index=['a','b','c']

In [46]:
ser1

a    22
b     5
c     3
Name: kali, dtype: int32

In [47]:
ser1.index=[np.arange(3)]

In [48]:
ser1

0    22
1     5
2     3
Name: kali, dtype: int32

In [49]:
ser1[ser1>10]

0    22
Name: kali, dtype: int32

In [50]:
!ls

mulit_uncmp.npz  multi_txt    pandas.ipynb
multi_cmp.npz	 numpy.ipynb  structered_arr.npy

In [51]:
!pwd

/home/k3problema/Desktop/jupyter_lab

In [52]:
ser1.sum()

30

In [53]:
ser1.min()

3

In [54]:
ser1.max()

22

In [55]:
ser1.describe()

count     3.000000
mean     10.000000
std      10.440307
min       3.000000
25%       4.000000
50%       5.000000
75%      13.500000
max      22.000000
Name: kali, dtype: float64

ser1.sin()

In [57]:
np.sin(ser1)

0   -0.008851
1   -0.958924
2    0.141120
Name: kali, dtype: float64

In [58]:
np.cumsum(ser1)

0    22
1    27
2    30
Name: kali, dtype: int64

In [59]:
np.cumprod(ser1)

0     22
1    110
2    330
Name: kali, dtype: int64

In [60]:
ser1.unique()

array([22,  5,  3], dtype=int32)

ser1+20

In [61]:
ser1

0    22
1     5
2     3
Name: kali, dtype: int32

In [62]:
ser1-2

0    20
1     3
2     1
Name: kali, dtype: int32

In [63]:
ser1+2

0    24
1     7
2     5
Name: kali, dtype: int32

In [64]:
3.5*ser1

0    77.0
1    17.5
2    10.5
Name: kali, dtype: float64

In [65]:
d2={"color":['red','green','blue'],'obj':['ball','pen','pencil'],'price':[25,5,3]}

In [66]:
d2

{'color': ['red', 'green', 'blue'],
 'obj': ['ball', 'pen', 'pencil'],
 'price': [25, 5, 3]}

In [67]:
df=pd.DataFrame(d2)

In [68]:
df

   color     obj  price
0    red    ball     25
1  green     pen      5
2   blue  pencil      3

In [71]:
df=pd.DataFrame(d2,index=['i1','i2','i3'])

In [72]:
df

    color     obj  price
i1    red    ball     25
i2  green     pen      5
i3   blue  pencil      3

In [73]:
df.name

AttributeError: 'DataFrame' object has no attribute 'name'

In [74]:
df.color

i1      red
i2    green
i3     blue
Name: color, dtype: object

In [75]:
df['color']

i1      red
i2    green
i3     blue
Name: color, dtype: object

In [76]:
df.index.name='item'

In [77]:
df.columns.name='summary'

In [78]:
df.columns.names=['COL','OBJ','MRP']

ValueError: Length of new names must be 1, got 3

In [79]:
df

summary  color     obj  price
item
i1         red    ball     25
i2       green     pen      5
i3        blue  pencil      3

In [80]:
df.columns=['COL','OBJ','MRP']

In [81]:
df

        COL     OBJ  MRP
item
i1      red    ball   25
i2    green     pen    5
i3     blue  pencil    3

In [85]:
df.columns.name='summary'

In [86]:
df

summary    COL     OBJ  MRP
item
i1         red    ball   25
i2       green     pen    5
i3        blue  pencil    3

In [1]:
import pandas as pd,numpy as np

In [2]:
ser1=pd.Series(np.arange(4),dtype='int32',index=['A','B','C','D'],name='seriestodf')

In [3]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [5]:
df=pd.DataFrame(np.arange(16).reshape(4,4),index=['A','B','C','D'],columns=['col1','col2','col3','col4'],dtype='int32')

In [6]:
df

   col1  col2  col3  col4
A     0     1     2     3
B     4     5     6     7
C     8     9    10    11
D    12    13    14    15

In [7]:
df['col5']=ser1

In [8]:
df

   col1  col2  col3  col4  col5
A     0     1     2     3     0
B     4     5     6     7     1
C     8     9    10    11     2
D    12    13    14    15     3

In [9]:
df.isin([4,3,5,20])

    col1   col2   col3   col4   col5
A  False  False  False   True  False
B   True   True  False  False  False
C  False  False  False  False  False
D  False  False  False  False   True

In [10]:
df[df.isin([4,3,5,20])]

   col1  col2  col3  col4  col5
A   NaN   NaN   NaN   3.0   NaN
B   4.0   5.0   NaN   NaN   NaN
C   NaN   NaN   NaN   NaN   NaN
D   NaN   NaN   NaN   NaN   3.0

In [11]:
df.isnull

<bound method DataFrame.isnull of    col1  col2  col3  col4  col5
A     0     1     2     3     0
B     4     5     6     7     1
C     8     9    10    11     2
D    12    13    14    15     3>

In [12]:
df.isnull()

    col1   col2   col3   col4   col5
A  False  False  False  False  False
B  False  False  False  False  False
C  False  False  False  False  False
D  False  False  False  False  False

In [13]:
df.notnull()

   col1  col2  col3  col4  col5
A  True  True  True  True  True
B  True  True  True  True  True
C  True  True  True  True  True
D  True  True  True  True  True

In [14]:
df.isna()

    col1   col2   col3   col4   col5
A  False  False  False  False  False
B  False  False  False  False  False
C  False  False  False  False  False
D  False  False  False  False  False

In [15]:
df['col6']=np.nan

In [16]:
df

   col1  col2  col3  col4  col5  col6
A     0     1     2     3     0   NaN
B     4     5     6     7     1   NaN
C     8     9    10    11     2   NaN
D    12    13    14    15     3   NaN

In [17]:
df.isnull()

    col1   col2   col3   col4   col5  col6
A  False  False  False  False  False  True
B  False  False  False  False  False  True
C  False  False  False  False  False  True
D  False  False  False  False  False  True

In [18]:
df.notnull()

   col1  col2  col3  col4  col5   col6
A  True  True  True  True  True  False
B  True  True  True  True  True  False
C  True  True  True  True  True  False
D  True  True  True  True  True  False

In [19]:
df.isna()

    col1   col2   col3   col4   col5  col6
A  False  False  False  False  False  True
B  False  False  False  False  False  True
C  False  False  False  False  False  True
D  False  False  False  False  False  True

In [20]:
df.isin([np.nan])

    col1   col2   col3   col4   col5  col6
A  False  False  False  False  False  True
B  False  False  False  False  False  True
C  False  False  False  False  False  True
D  False  False  False  False  False  True

In [22]:
df['col1']['A']

0

In [23]:
df['col2']['C']

9

In [30]:
df[:3]

   col1  col2  col3  col4  col5  col6
A     0     1     2     3     0   NaN
B     4     5     6     7     1   NaN
C     8     9    10    11     2   NaN

In [33]:
df

   col1  col2  col3  col4  col5  col6
A     0     1     2     3     0   NaN
B     4     5     6     7     1   NaN
C     8     9    10    11     2   NaN
D    12    13    14    15     3   NaN

In [34]:
df[df>11]

   col1  col2  col3  col4  col5  col6
A   NaN   NaN   NaN   NaN   NaN   NaN
B   NaN   NaN   NaN   NaN   NaN   NaN
C   NaN   NaN   NaN   NaN   NaN   NaN
D  12.0  13.0  14.0  15.0   NaN   NaN

In [35]:
df.T

        A    B     C     D
col1  0.0  4.0   8.0  12.0
col2  1.0  5.0   9.0  13.0
col3  2.0  6.0  10.0  14.0
col4  3.0  7.0  11.0  15.0
col5  0.0  1.0   2.0   3.0
col6  NaN  NaN   NaN   NaN

In [38]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [39]:
ser1.idxmin()

'A'

In [40]:
ser1.idxmax()

'D'

In [41]:
df.idxmin()

col1      A
col2      A
col3      A
col4      A
col5      A
col6    NaN
dtype: object

In [42]:
df.idxmax()

col1      D
col2      D
col3      D
col4      D
col5      D
col6    NaN
dtype: object

In [43]:
df

   col1  col2  col3  col4  col5  col6
A     0     1     2     3     0   NaN
B     4     5     6     7     1   NaN
C     8     9    10    11     2   NaN
D    12    13    14    15     3   NaN

In [45]:
df.index.is_unique

True

In [46]:
ser1.index.is_numeric

In [47]:
df.ffill()

   col1  col2  col3  col4  col5  col6
A     0     1     2     3     0   NaN
B     4     5     6     7     1   NaN
C     8     9    10    11     2   NaN
D    12    13    14    15     3   NaN

In [48]:
df.bfill()

   col1  col2  col3  col4  col5  col6
A     0     1     2     3     0   NaN
B     4     5     6     7     1   NaN
C     8     9    10    11     2   NaN
D    12    13    14    15     3   NaN

In [49]:
df.ffill?

Signature: df.ffill(axis=None, inplace: bool = False, limit=None, downcast=None) -> Optional[~FrameOrSeries]
Docstring:
Synonym for :meth:`DataFrame.fillna` with ``method='ffill'``.

Returns
-------
{klass} or None
    Object with missing values filled or None if ``inplace=True``.
File:      /usr/lib/python3/dist-packages/pandas/core/generic.py
Type:      method

In [51]:
del df['col6']

In [52]:
df

   col1  col2  col3  col4  col5
A     0     1     2     3     0
B     4     5     6     7     1
C     8     9    10    11     2
D    12    13    14    15     3

In [53]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [54]:
ser1.drop?

Signature:
ser1.drop(
    labels=None,
    axis=0,
    index=None,
    columns=None,
    level=None,
    inplace=False,
    errors='raise',
) -> 'Series'
Docstring:
Return Series with specified index labels removed.

Remove elements of a Series based on specifying the index labels.
When using a multi-index, labels on different levels can be removed
by specifying the level.

Parameters
----------
labels : single label or list-like
    Index labels to drop.
axis : 0, default 0
    Redundant for application on Series.
index : single label or list-like
    Redundant for application on Series, but 'index' can be used instead
    of 'labels'.
columns : single label or list-like
    No change is made to the Series; use 'index' or 'labels' instead.
level : int or level name, optional
    For MultiIndex, level for which the labels will be removed.
inplace : bool, default False
    If True, do operation inplace and return None.
errors : {'ignore', 'raise'}, default 'raise'
    If 'ignore', suppress error and only existing labels are dropped.

Returns
-------
Series
    Series with specified index labels removed.

Raises
------
KeyError
    If none of the labels are found in the index.

See Also
--------
Series.reindex : Return only specified index labels of Series.
Series.dropna : Return series without null values.
Series.drop_duplicates : Return Series with duplicate values removed.
DataFrame.drop : Drop specified labels from rows or columns.

Examples
--------
>>> s = pd.Series(data=np.arange(3), index=['A', 'B', 'C'])
>>> s
A  0
B  1
C  2
dtype: int64

Drop labels B en C

>>> s.drop(labels=['B', 'C'])
A  0
dtype: int64

Drop 2nd level label in MultiIndex Series

>>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
...                              ['speed', 'weight', 'length']],
...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
>>> s = pd.Series([45, 200, 1.2, 30, 250, 1.5, 320, 1, 0.3],
...               index=midx)
>>> s
lama    speed      45.0
        weight    200.0
        length      1.2
cow     speed      30.0
        weight    250.0
        length      1.5
falcon  speed     320.0
        weight      1.0
        length      0.3
dtype: float64

>>> s.drop(labels='weight', level=1)
lama    speed      45.0
        length      1.2
cow     speed      30.0
        length      1.5
falcon  speed     320.0
        length      0.3
dtype: float64
File:      /usr/lib/python3/dist-packages/pandas/core/series.py
Type:      method

In [55]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [56]:
ser1.drop('A')

B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [57]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [58]:
ser1.drop(['A','C'],inplace=False)

B    1
D    3
Name: seriestodf, dtype: int32

In [59]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [60]:
df

   col1  col2  col3  col4  col5
A     0     1     2     3     0
B     4     5     6     7     1
C     8     9    10    11     2
D    12    13    14    15     3

In [61]:
df.drop('B',axis=0)

   col1  col2  col3  col4  col5
A     0     1     2     3     0
C     8     9    10    11     2
D    12    13    14    15     3

In [62]:
df.drop('B')

   col1  col2  col3  col4  col5
A     0     1     2     3     0
C     8     9    10    11     2
D    12    13    14    15     3

In [63]:
df.drop('col3',axis=1)

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [64]:
df.drop('col3',axis=1,inplace=True)

In [65]:
df

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [66]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [67]:
ser1.add(df)

    A   B   C   D  col1  col2  col4  col5
A NaN NaN NaN NaN   NaN   NaN   NaN   NaN
B NaN NaN NaN NaN   NaN   NaN   NaN   NaN
C NaN NaN NaN NaN   NaN   NaN   NaN   NaN
D NaN NaN NaN NaN   NaN   NaN   NaN   NaN

In [68]:
ser1.T.add(df)

    A   B   C   D  col1  col2  col4  col5
A NaN NaN NaN NaN   NaN   NaN   NaN   NaN
B NaN NaN NaN NaN   NaN   NaN   NaN   NaN
C NaN NaN NaN NaN   NaN   NaN   NaN   NaN
D NaN NaN NaN NaN   NaN   NaN   NaN   NaN

In [70]:
ser1.T

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [71]:
df.add(df)

   col1  col2  col4  col5
A     0     2     6     0
B     8    10    14     2
C    16    18    22     4
D    24    26    30     6

In [72]:
df

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [73]:
df+df

   col1  col2  col4  col5
A     0     2     6     0
B     8    10    14     2
C    16    18    22     4
D    24    26    30     6

In [74]:
df-df

   col1  col2  col4  col5
A     0     0     0     0
B     0     0     0     0
C     0     0     0     0
D     0     0     0     0

In [75]:
df.sub(df)

   col1  col2  col4  col5
A     0     0     0     0
B     0     0     0     0
C     0     0     0     0
D     0     0     0     0

In [76]:
df*3

   col1  col2  col4  col5
A     0     3     9     0
B    12    15    21     3
C    24    27    33     6
D    36    39    45     9

In [80]:
for i in df.values:
    print(i**2)

[0 1 9 0]
[16 25 49  1]
[ 64  81 121   4]
[144 169 225   9]

In [81]:
for i in df.index:
    print(i)

A
B
C
D

In [82]:
for i in df.columns:
    print(i)

col1
col2
col4
col5

In [83]:
for i in df:
    print(i)

col1
col2
col4
col5

In [84]:
df-ser1

    A   B   C   D  col1  col2  col4  col5
A NaN NaN NaN NaN   NaN   NaN   NaN   NaN
B NaN NaN NaN NaN   NaN   NaN   NaN   NaN
C NaN NaN NaN NaN   NaN   NaN   NaN   NaN
D NaN NaN NaN NaN   NaN   NaN   NaN   NaN

In [90]:
ser2=pd.Series(np.arange(4),index=['pen','pencil','ball','paper'],dtype='int32',name='myser')
df2=pd.DataFrame(np.arange(25).reshape(5,5),columns=['pen','pencil','ball','paper','mug'],index=['col1','col2','col3','col4','col5'],dtype='int32')

In [91]:
df2-ser2

      ball  mug  paper   pen  pencil
col1   0.0  NaN    0.0   0.0     0.0
col2   5.0  NaN    5.0   5.0     5.0
col3  10.0  NaN   10.0  10.0    10.0
col4  15.0  NaN   15.0  15.0    15.0
col5  20.0  NaN   20.0  20.0    20.0

In [92]:
dfser=df2-ser2

In [93]:
dfser.isnull()

       ball   mug  paper    pen  pencil
col1  False  True  False  False   False
col2  False  True  False  False   False
col3  False  True  False  False   False
col4  False  True  False  False   False
col5  False  True  False  False   False

In [94]:
df2

      pen  pencil  ball  paper  mug
col1    0       1     2      3    4
col2    5       6     7      8    9
col3   10      11    12     13   14
col4   15      16    17     18   19
col5   20      21    22     23   24

In [95]:
np.sin(df2)

           pen    pencil      ball     paper       mug
col1  0.000000  0.841471  0.909297  0.141120 -0.756802
col2 -0.958924 -0.279415  0.656987  0.989358  0.412118
col3 -0.544021 -0.999990 -0.536573  0.420167  0.990607
col4  0.650288 -0.287903 -0.961397 -0.750987  0.149877
col5  0.912945  0.836656 -0.008851 -0.846220 -0.905578

In [96]:
np.min(df2)

pen       0
pencil    1
ball      2
paper     3
mug       4
dtype: int32

In [97]:
np.min(df2,axis=1)

col1     0
col2     5
col3    10
col4    15
col5    20
dtype: int32

In [98]:
df.sum()

col1    24
col2    28
col4    36
col5     6
dtype: int64

In [99]:
df.sum(axis=1)

A     4
B    17
C    30
D    43
dtype: int64

In [100]:
df

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [101]:
df.min()

col1    0
col2    1
col4    3
col5    0
dtype: int32

In [102]:
df.min(axis=1)

A    0
B    1
C    2
D    3
dtype: int32

In [103]:
df.mean()

col1    6.0
col2    7.0
col4    9.0
col5    1.5
dtype: float64

In [104]:
df.std()

col1    5.163978
col2    5.163978
col4    5.163978
col5    1.290994
dtype: float64

In [106]:
df.describe()

            col1       col2       col4      col5
count   4.000000   4.000000   4.000000  4.000000
mean    6.000000   7.000000   9.000000  1.500000
std     5.163978   5.163978   5.163978  1.290994
min     0.000000   1.000000   3.000000  0.000000
25%     3.000000   4.000000   6.000000  0.750000
50%     6.000000   7.000000   9.000000  1.500000
75%     9.000000  10.000000  12.000000  2.250000
max    12.000000  13.000000  15.000000  3.000000

In [111]:
df.describe?

Signature:
df.describe(
    percentiles=None,
    include=None,
    exclude=None,
    datetime_is_numeric=False,
) -> ~FrameOrSeries
Docstring:
Generate descriptive statistics.

Descriptive statistics include those that summarize the central
tendency, dispersion and shape of a
dataset's distribution, excluding ``NaN`` values.

Analyzes both numeric and object series, as well
as ``DataFrame`` column sets of mixed data types. The output
will vary depending on what is provided. Refer to the notes
below for more detail.

Parameters
----------
percentiles : list-like of numbers, optional
    The percentiles to include in the output. All should
    fall between 0 and 1. The default is
    ``[.25, .5, .75]``, which returns the 25th, 50th, and
    75th percentiles.
include : 'all', list-like of dtypes or None (default), optional
    A white list of data types to include in the result. Ignored
    for ``Series``. Here are the options:

    - 'all' : All columns of the input will be included in the output.
    - A list-like of dtypes : Limits the results to the
      provided data types.
      To limit the result to numeric types submit
      ``numpy.number``. To limit it instead to object columns submit
      the ``numpy.object`` data type. Strings
      can also be used in the style of
      ``select_dtypes`` (e.g. ``df.describe(include=['O'])``). To
      select pandas categorical columns, use ``'category'``
    - None (default) : The result will include all numeric columns.
exclude : list-like of dtypes or None (default), optional,
    A black list of data types to omit from the result. Ignored
    for ``Series``. Here are the options:

    - A list-like of dtypes : Excludes the provided data types
      from the result. To exclude numeric types submit
      ``numpy.number``. To exclude object columns submit the data
      type ``numpy.object``. Strings can also be used in the style of
      ``select_dtypes`` (e.g. ``df.describe(include=['O'])``). To
      exclude pandas categorical columns, use ``'category'``
    - None (default) : The result will exclude nothing.
datetime_is_numeric : bool, default False
    Whether to treat datetime dtypes as numeric. This affects statistics
    calculated for the column. For DataFrame input, this also
    controls whether datetime columns are included by default.

    .. versionadded:: 1.1.0

Returns
-------
Series or DataFrame
    Summary statistics of the Series or Dataframe provided.

See Also
--------
DataFrame.count: Count number of non-NA/null observations.
DataFrame.max: Maximum of the values in the object.
DataFrame.min: Minimum of the values in the object.
DataFrame.mean: Mean of the values.
DataFrame.std: Standard deviation of the observations.
DataFrame.select_dtypes: Subset of a DataFrame including/excluding
    columns based on their dtype.

Notes
-----
For numeric data, the result's index will include ``count``,
``mean``, ``std``, ``min``, ``max`` as well as lower, ``50`` and
upper percentiles. By default the lower percentile is ``25`` and the
upper percentile is ``75``. The ``50`` percentile is the
same as the median.

For object data (e.g. strings or timestamps), the result's index
will include ``count``, ``unique``, ``top``, and ``freq``. The ``top``
is the most common value. The ``freq`` is the most common value's
frequency. Timestamps also include the ``first`` and ``last`` items.

If multiple object values have the highest count, then the
``count`` and ``top`` results will be arbitrarily chosen from
among those with the highest count.

For mixed data types provided via a ``DataFrame``, the default is to
return only an analysis of numeric columns. If the dataframe consists
only of object and categorical data without any numeric columns, the
default is to return an analysis of both the object and categorical
columns. If ``include='all'`` is provided as an option, the result
will include a union of attributes of each type.

The `include` and `exclude` parameters can be used to limit
which columns in a ``DataFrame`` are analyzed for the output.
The parameters are ignored when analyzing a ``Series``.

Examples
--------
Describing a numeric ``Series``.

>>> s = pd.Series([1, 2, 3])
>>> s.describe()
count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

Describing a categorical ``Series``.

>>> s = pd.Series(['a', 'a', 'b', 'c'])
>>> s.describe()
count     4
unique    3
top       a
freq      2
dtype: object

Describing a timestamp ``Series``.

>>> s = pd.Series([
...   np.datetime64("2000-01-01"),
...   np.datetime64("2010-01-01"),
...   np.datetime64("2010-01-01")
... ])
>>> s.describe(datetime_is_numeric=True)
count                      3
mean     2006-09-01 08:00:00
min      2000-01-01 00:00:00
25%      2004-12-31 12:00:00
50%      2010-01-01 00:00:00
75%      2010-01-01 00:00:00
max      2010-01-01 00:00:00
dtype: object

Describing a ``DataFrame``. By default only numeric fields
are returned.

>>> df = pd.DataFrame({'categorical': pd.Categorical(['d','e','f']),
...                    'numeric': [1, 2, 3],
...                    'object': ['a', 'b', 'c']
...                   })
>>> df.describe()
       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

Describing all columns of a ``DataFrame`` regardless of data type.

>>> df.describe(include='all')  # doctest: +SKIP
       categorical  numeric object
count            3      3.0      3
unique           3      NaN      3
top              f      NaN      a
freq             1      NaN      1
mean           NaN      2.0    NaN
std            NaN      1.0    NaN
min            NaN      1.0    NaN
25%            NaN      1.5    NaN
50%            NaN      2.0    NaN
75%            NaN      2.5    NaN
max            NaN      3.0    NaN

Describing a column from a ``DataFrame`` by accessing it as
an attribute.

>>> df.numeric.describe()
count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
Name: numeric, dtype: float64

Including only numeric columns in a ``DataFrame`` description.

>>> df.describe(include=[np.number])
       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

Including only string columns in a ``DataFrame`` description.

>>> df.describe(include=[object])  # doctest: +SKIP
       object
count       3
unique      3
top         a
freq        1

Including only categorical columns from a ``DataFrame`` description.

>>> df.describe(include=['category'])
       categorical
count            3
unique           3
top              f
freq             1

Excluding numeric columns from a ``DataFrame`` description.

>>> df.describe(exclude=[np.number])  # doctest: +SKIP
       categorical object
count            3      3
unique           3      3
top              f      a
freq             1      1

Excluding object columns from a ``DataFrame`` description.

>>> df.describe(exclude=[object])  # doctest: +SKIP
       categorical  numeric
count            3      3.0
unique           3      NaN
top              f      NaN
freq             1      NaN
mean           NaN      2.0
std            NaN      1.0
min            NaN      1.0
25%            NaN      1.5
50%            NaN      2.0
75%            NaN      2.5
max            NaN      3.0
File:      /usr/lib/python3/dist-packages/pandas/core/generic.py
Type:      method

In [112]:
df.describe(include='all')

            col1       col2       col4      col5
count   4.000000   4.000000   4.000000  4.000000
mean    6.000000   7.000000   9.000000  1.500000
std     5.163978   5.163978   5.163978  1.290994
min     0.000000   1.000000   3.000000  0.000000
25%     3.000000   4.000000   6.000000  0.750000
50%     6.000000   7.000000   9.000000  1.500000
75%     9.000000  10.000000  12.000000  2.250000
max    12.000000  13.000000  15.000000  3.000000

In [113]:
df.describe()

            col1       col2       col4      col5
count   4.000000   4.000000   4.000000  4.000000
mean    6.000000   7.000000   9.000000  1.500000
std     5.163978   5.163978   5.163978  1.290994
min     0.000000   1.000000   3.000000  0.000000
25%     3.000000   4.000000   6.000000  0.750000
50%     6.000000   7.000000   9.000000  1.500000
75%     9.000000  10.000000  12.000000  2.250000
max    12.000000  13.000000  15.000000  3.000000

In [114]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [115]:
ser1.index=[np.random.random(4)]

In [116]:
ser1

0.250817    0
0.095906    1
0.304879    2
0.868328    3
Name: seriestodf, dtype: int32

In [117]:
ser1

0.250817    0
0.095906    1
0.304879    2
0.868328    3
Name: seriestodf, dtype: int32

In [118]:
ser1.sort_index()

0.095906    1
0.250817    0
0.304879    2
0.868328    3
Name: seriestodf, dtype: int32

In [119]:
ser1.sort_index(ascending=False)

0.868328    3
0.304879    2
0.250817    0
0.095906    1
Name: seriestodf, dtype: int32

In [120]:
df

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [121]:
df.sort_index(ascending=False)

   col1  col2  col4  col5
D    12    13    15     3
C     8     9    11     2
B     4     5     7     1
A     0     1     3     0

In [122]:
df.sort_index(ascending=False,axis=1)

   col5  col4  col2  col1
A     0     3     1     0
B     1     7     5     4
C     2    11     9     8
D     3    15    13    12

In [124]:
df.sort_index?

Signature:
df.sort_index(
    axis=0,
    level=None,
    ascending: bool = True,
    inplace: bool = False,
    kind: str = 'quicksort',
    na_position: str = 'last',
    sort_remaining: bool = True,
    ignore_index: bool = False,
    key: Optional[Callable[[ForwardRef('Index')], Union[ForwardRef('Index'), ~AnyArrayLike]]] = None,
)
Docstring:
Sort object by labels (along an axis).

Returns a new DataFrame sorted by label if `inplace` argument is
``False``, otherwise updates the original DataFrame and returns None.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    The axis along which to sort.  The value 0 identifies the rows,
    and 1 identifies the columns.
level : int or level name or list of ints or list of level names
    If not None, sort on values in specified index level(s).
ascending : bool or list of bools, default True
    Sort ascending vs. descending. When the index is a MultiIndex the
    sort direction can be controlled for each level individually.
inplace : bool, default False
    If True, perform operation in-place.
kind : {'quicksort', 'mergesort', 'heapsort'}, default 'quicksort'
    Choice of sorting algorithm. See also ndarray.np.sort for more
    information.  `mergesort` is the only stable algorithm. For
    DataFrames, this option is only applied when sorting on a single
    column or label.
na_position : {'first', 'last'}, default 'last'
    Puts NaNs at the beginning if `first`; `last` puts NaNs at the end.
    Not implemented for MultiIndex.
sort_remaining : bool, default True
    If True and sorting by level and index is multilevel, sort by other
    levels too (in order) after sorting by specified level.
ignore_index : bool, default False
    If True, the resulting axis will be labeled 0, 1, , n - 1.

    .. versionadded:: 1.0.0

key : callable, optional
    If not None, apply the key function to the index values
    before sorting. This is similar to the `key` argument in the
    builtin :meth:`sorted` function, with the notable difference that
    this `key` function should be *vectorized*. It should expect an
    ``Index`` and return an ``Index`` of the same shape. For MultiIndex
    inputs, the key is applied *per level*.

    .. versionadded:: 1.1.0

Returns
-------
DataFrame
    The original DataFrame sorted by the labels.

See Also
--------
Series.sort_index : Sort Series by the index.
DataFrame.sort_values : Sort DataFrame by the value.
Series.sort_values : Sort Series by the value.

Examples
--------
>>> df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150],
...                   columns=['A'])
>>> df.sort_index()
     A
1    4
29   2
100  1
150  5
234  3

By default, it sorts in ascending order, to sort in descending order,
use ``ascending=False``

>>> df.sort_index(ascending=False)
     A
234  3
150  5
100  1
29   2
1    4

A key function can be specified which is applied to the index before
sorting. For a ``MultiIndex`` this is applied to each level separately.

>>> df = pd.DataFrame({"a": [1, 2, 3, 4]}, index=['A', 'b', 'C', 'd'])
>>> df.sort_index(key=lambda x: x.str.lower())
   a
A  1
b  2
C  3
d  4
File:      /usr/lib/python3/dist-packages/pandas/core/frame.py
Type:      method

In [125]:
ser1.order()

AttributeError: 'Series' object has no attribute 'order'

In [126]:
ser1

0.250817    0
0.095906    1
0.304879    2
0.868328    3
Name: seriestodf, dtype: int32

In [127]:
df.sort_index(by='col2')

TypeError: sort_index() got an unexpected keyword argument 'by'

In [128]:
ser1.rank()

0.250817    1.0
0.095906    2.0
0.304879    3.0
0.868328    4.0
Name: seriestodf, dtype: float64

In [129]:
ser1.rank?

Signature:
ser1.rank(
    axis=0,
    method: str = 'average',
    numeric_only: Optional[bool] = None,
    na_option: str = 'keep',
    ascending: bool = True,
    pct: bool = False,
) -> ~FrameOrSeries
Docstring:
Compute numerical data ranks (1 through n) along axis.

By default, equal values are assigned a rank that is the average of the
ranks of those values.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Index to direct ranking.
method : {'average', 'min', 'max', 'first', 'dense'}, default 'average'
    How to rank the group of records that have the same value (i.e. ties):

    * average: average rank of the group
    * min: lowest rank in the group
    * max: highest rank in the group
    * first: ranks assigned in order they appear in the array
    * dense: like 'min', but rank always increases by 1 between groups.

numeric_only : bool, optional
    For DataFrame objects, rank only numeric columns if set to True.
na_option : {'keep', 'top', 'bottom'}, default 'keep'
    How to rank NaN values:

    * keep: assign NaN rank to NaN values
    * top: assign smallest rank to NaN values if ascending
    * bottom: assign highest rank to NaN values if ascending.

ascending : bool, default True
    Whether or not the elements should be ranked in ascending order.
pct : bool, default False
    Whether or not to display the returned rankings in percentile
    form.

Returns
-------
same type as caller
    Return a Series or DataFrame with data ranks as values.

See Also
--------
core.groupby.GroupBy.rank : Rank of values within each group.

Examples
--------
>>> df = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog',
...                                    'spider', 'snake'],
...                         'Number_legs': [4, 2, 4, 8, np.nan]})
>>> df
    Animal  Number_legs
0      cat          4.0
1  penguin          2.0
2      dog          4.0
3   spider          8.0
4    snake          NaN

The following example shows how the method behaves with the above
parameters:

* default_rank: this is the default behaviour obtained without using
  any parameter.
* max_rank: setting ``method = 'max'`` the records that have the
  same values are ranked using the highest rank (e.g.: since 'cat'
  and 'dog' are both in the 2nd and 3rd position, rank 3 is assigned.)
* NA_bottom: choosing ``na_option = 'bottom'``, if there are records
  with NaN values they are placed at the bottom of the ranking.
* pct_rank: when setting ``pct = True``, the ranking is expressed as
  percentile rank.

>>> df['default_rank'] = df['Number_legs'].rank()
>>> df['max_rank'] = df['Number_legs'].rank(method='max')
>>> df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom')
>>> df['pct_rank'] = df['Number_legs'].rank(pct=True)
>>> df
    Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
0      cat          4.0           2.5       3.0        2.5     0.625
1  penguin          2.0           1.0       1.0        1.0     0.250
2      dog          4.0           2.5       3.0        2.5     0.625
3   spider          8.0           4.0       4.0        4.0     1.000
4    snake          NaN           NaN       NaN        5.0       NaN
File:      /usr/lib/python3/dist-packages/pandas/core/generic.py
Type:      method

In [130]:
df.rank()

   col1  col2  col4  col5
A   1.0   1.0   1.0   1.0
B   2.0   2.0   2.0   2.0
C   3.0   3.0   3.0   3.0
D   4.0   4.0   4.0   4.0

In [131]:
df

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [132]:
df.corr()

      col1  col2  col4  col5
col1   1.0   1.0   1.0   1.0
col2   1.0   1.0   1.0   1.0
col4   1.0   1.0   1.0   1.0
col5   1.0   1.0   1.0   1.0

In [133]:
df.cov()

           col1       col2       col4      col5
col1  26.666667  26.666667  26.666667  6.666667
col2  26.666667  26.666667  26.666667  6.666667
col4  26.666667  26.666667  26.666667  6.666667
col5   6.666667   6.666667   6.666667  1.666667

In [134]:
ser1

0.250817    0
0.095906    1
0.304879    2
0.868328    3
Name: seriestodf, dtype: int32

In [135]:
df.corrwith(ser1)

col1   NaN
col2   NaN
col4   NaN
col5   NaN
dtype: float64

In [136]:
df

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [137]:
ser1.index=['A','B','C','D']

In [138]:
df.corrwith(ser1)

col1    1.0
col2    1.0
col4    1.0
col5    1.0
dtype: float64

In [139]:
ser1.corr(ser1)

1.0

In [140]:
ser1.cov(ser1)

1.6666666666666665

In [141]:
df.corr()

      col1  col2  col4  col5
col1   1.0   1.0   1.0   1.0
col2   1.0   1.0   1.0   1.0
col4   1.0   1.0   1.0   1.0
col5   1.0   1.0   1.0   1.0

In [142]:
df.cov()

           col1       col2       col4      col5
col1  26.666667  26.666667  26.666667  6.666667
col2  26.666667  26.666667  26.666667  6.666667
col4  26.666667  26.666667  26.666667  6.666667
col5   6.666667   6.666667   6.666667  1.666667

In [143]:
df

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [144]:
df2

      pen  pencil  ball  paper  mug
col1    0       1     2      3    4
col2    5       6     7      8    9
col3   10      11    12     13   14
col4   15      16    17     18   19
col5   20      21    22     23   24

In [145]:
ser2

pen       0
pencil    1
ball      2
paper     3
Name: myser, dtype: int32

In [146]:
df2['mug']['col2']=np.nan

In [147]:
df2

      pen  pencil  ball  paper   mug
col1    0       1     2      3   4.0
col2    5       6     7      8   NaN
col3   10      11    12     13  14.0
col4   15      16    17     18  19.0
col5   20      21    22     23  24.0

In [148]:
ser1[1]=np.nan

ValueError: cannot convert float NaN to integer

In [149]:
ser1

A    0
B    1
C    2
D    3
Name: seriestodf, dtype: int32

In [150]:
ser1['A']=np.nan

In [151]:
ser1

A    NaN
B    1.0
C    2.0
D    3.0
Name: seriestodf, dtype: float64

In [152]:
ser1.dropna()

B    1.0
C    2.0
D    3.0
Name: seriestodf, dtype: float64

In [153]:
df2

      pen  pencil  ball  paper   mug
col1    0       1     2      3   4.0
col2    5       6     7      8   NaN
col3   10      11    12     13  14.0
col4   15      16    17     18  19.0
col5   20      21    22     23  24.0

In [154]:
df2['new']=np.nan

In [155]:
df2

      pen  pencil  ball  paper   mug  new
col1    0       1     2      3   4.0  NaN
col2    5       6     7      8   NaN  NaN
col3   10      11    12     13  14.0  NaN
col4   15      16    17     18  19.0  NaN
col5   20      21    22     23  24.0  NaN

In [156]:
df2.dropna()

Empty DataFrame
Columns: [pen, pencil, ball, paper, mug, new]
Index: []

In [157]:
df2.dropna?

Signature: df2.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    .. versionchanged:: 1.0.0

       Pass tuple or list to drop on multiple axes.
       Only a single axis is allowed.

how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

thresh : int, optional
    Require that many non-NA values.
subset : array-like, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    If True, do operation inplace and return None.

Returns
-------
DataFrame
    DataFrame with NA entries dropped from it.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'born'])
       name        toy       born
1    Batman  Batmobile 1940-04-25

Keep the DataFrame with valid entries in the same variable.

>>> df.dropna(inplace=True)
>>> df
     name        toy       born
1  Batman  Batmobile 1940-04-25
File:      /usr/lib/python3/dist-packages/pandas/core/frame.py
Type:      method

In [158]:
df2

      pen  pencil  ball  paper   mug  new
col1    0       1     2      3   4.0  NaN
col2    5       6     7      8   NaN  NaN
col3   10      11    12     13  14.0  NaN
col4   15      16    17     18  19.0  NaN
col5   20      21    22     23  24.0  NaN

In [159]:
df2.dropna(how='all')

      pen  pencil  ball  paper   mug  new
col1    0       1     2      3   4.0  NaN
col2    5       6     7      8   NaN  NaN
col3   10      11    12     13  14.0  NaN
col4   15      16    17     18  19.0  NaN
col5   20      21    22     23  24.0  NaN

In [160]:
df2.dropna(axis=1,how='all')

      pen  pencil  ball  paper   mug
col1    0       1     2      3   4.0
col2    5       6     7      8   NaN
col3   10      11    12     13  14.0
col4   15      16    17     18  19.0
col5   20      21    22     23  24.0

In [161]:
df2.ffill()

      pen  pencil  ball  paper   mug  new
col1    0       1     2      3   4.0  NaN
col2    5       6     7      8   4.0  NaN
col3   10      11    12     13  14.0  NaN
col4   15      16    17     18  19.0  NaN
col5   20      21    22     23  24.0  NaN

In [162]:
df2.bfill()

      pen  pencil  ball  paper   mug  new
col1    0       1     2      3   4.0  NaN
col2    5       6     7      8  14.0  NaN
col3   10      11    12     13  14.0  NaN
col4   15      16    17     18  19.0  NaN
col5   20      21    22     23  24.0  NaN

In [163]:
df2.bfill?

Signature: df2.bfill(axis=None, inplace: bool = False, limit=None, downcast=None) -> Optional[~FrameOrSeries]
Docstring:
Synonym for :meth:`DataFrame.fillna` with ``method='bfill'``.

Returns
-------
{klass} or None
    Object with missing values filled or None if ``inplace=True``.
File:      /usr/lib/python3/dist-packages/pandas/core/generic.py
Type:      method

In [164]:
df2.ffill(axis=1)

       pen  pencil  ball  paper   mug   new
col1   0.0     1.0   2.0    3.0   4.0   4.0
col2   5.0     6.0   7.0    8.0   8.0   8.0
col3  10.0    11.0  12.0   13.0  14.0  14.0
col4  15.0    16.0  17.0   18.0  19.0  19.0
col5  20.0    21.0  22.0   23.0  24.0  24.0

In [165]:
df.fillna(11)

   col1  col2  col4  col5
A     0     1     3     0
B     4     5     7     1
C     8     9    11     2
D    12    13    15     3

In [166]:
df2.fillna(22)

      pen  pencil  ball  paper   mug   new
col1    0       1     2      3   4.0  22.0
col2    5       6     7      8  22.0  22.0
col3   10      11    12     13  14.0  22.0
col4   15      16    17     18  19.0  22.0
col5   20      21    22     23  24.0  22.0

In [167]:
df.fillna?

Signature:
df.fillna(
    value=None,
    method=None,
    axis=None,
    inplace=False,
    limit=None,
    downcast=None,
) -> Optional[ForwardRef('DataFrame')]
Docstring:
Fill NA/NaN values using the specified method.

Parameters
----------
value : scalar, dict, Series, or DataFrame
    Value to use to fill holes (e.g. 0), alternately a
    dict/Series/DataFrame of values specifying which value to use for
    each index (for a Series) or column (for a DataFrame).  Values not
    in the dict/Series/DataFrame will not be filled. This value cannot
    be a list.
method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
    Method to use for filling holes in reindexed Series
    pad / ffill: propagate last valid observation forward to next valid
    backfill / bfill: use next valid observation to fill gap.
axis : {0 or 'index', 1 or 'columns'}
    Axis along which to fill missing values.
inplace : bool, default False
    If True, fill in-place. Note: this will modify any
    other views on this object (e.g., a no-copy slice for a column in a
    DataFrame).
limit : int, default None
    If method is specified, this is the maximum number of consecutive
    NaN values to forward/backward fill. In other words, if there is
    a gap with more than this number of consecutive NaNs, it will only
    be partially filled. If method is not specified, this is the
    maximum number of entries along the entire axis where NaNs will be
    filled. Must be greater than 0 if not None.
downcast : dict, default is None
    A dict of item->dtype of what to downcast if possible,
    or the string 'infer' which will try to downcast to an appropriate
    equal type (e.g. float64 to int64 if possible).

Returns
-------
DataFrame or None
    Object with missing values filled or None if ``inplace=True``.

See Also
--------
interpolate : Fill NaN values using interpolation.
reindex : Conform object to new index.
asfreq : Convert TimeSeries to specified frequency.

Examples
--------
>>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
...                    [3, 4, np.nan, 1],
...                    [np.nan, np.nan, np.nan, 5],
...                    [np.nan, 3, np.nan, 4]],
...                   columns=list('ABCD'))
>>> df
     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

Replace all NaN elements with 0s.

>>> df.fillna(0)
    A   B   C   D
0   0.0 2.0 0.0 0
1   3.0 4.0 0.0 1
2   0.0 0.0 0.0 5
3   0.0 3.0 0.0 4

We can also propagate non-null values forward or backward.

>>> df.fillna(method='ffill')
    A   B   C   D
0   NaN 2.0 NaN 0
1   3.0 4.0 NaN 1
2   3.0 4.0 NaN 5
3   3.0 3.0 NaN 4

Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
2, and 3 respectively.

>>> values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
>>> df.fillna(value=values)
    A   B   C   D
0   0.0 2.0 2.0 0
1   3.0 4.0 2.0 1
2   0.0 1.0 2.0 5
3   0.0 3.0 2.0 4

Only replace the first NaN element.

>>> df.fillna(value=values, limit=1)
    A   B   C   D
0   0.0 2.0 2.0 0
1   3.0 4.0 NaN 1
2   NaN 1.0 NaN 5
3   NaN 3.0 NaN 4
File:      /usr/lib/python3/dist-packages/pandas/core/frame.py
Type:      method

In [169]:
df2.fillna(123,axis=1,limit=2)

      pen  pencil  ball  paper    mug    new
col1    0       1     2      3    4.0  123.0
col2    5       6     7      8  123.0  123.0
col3   10      11    12     13   14.0    NaN
col4   15      16    17     18   19.0    NaN
col5   20      21    22     23   24.0    NaN

In [170]:
df2

      pen  pencil  ball  paper   mug  new
col1    0       1     2      3   4.0  NaN
col2    5       6     7      8   NaN  NaN
col3   10      11    12     13  14.0  NaN
col4   15      16    17     18  19.0  NaN
col5   20      21    22     23  24.0  NaN

In [171]:
values={'pen':11,'pencil':22,'ball':33,'paper':44,'mug':55,'new':66}
df2.fillna(values,limit=3)

      pen  pencil  ball  paper   mug   new
col1    0       1     2      3   4.0  66.0
col2    5       6     7      8  55.0  66.0
col3   10      11    12     13  14.0  66.0
col4   15      16    17     18  19.0   NaN
col5   20      21    22     23  24.0   NaN

In [179]:
ser3=pd.Series(np.random.random(12),index=[['first','first','first','second','second','second','third','third','third','fourth','fourth','fourth'],['up','down','centre','up','down','centre','up','down','centre','up','down','centre']])

In [180]:
ser3

first   up        0.094665
        down      0.288364
        centre    0.654265
second  up        0.250094
        down      0.389019
        centre    0.402110
third   up        0.811684
        down      0.735796
        centre    0.931845
fourth  up        0.803075
        down      0.782089
        centre    0.971210
dtype: float64

In [181]:
pd.MultiIndex?

Init signature:
pd.MultiIndex(
    levels=None,
    codes=None,
    sortorder=None,
    names=None,
    dtype=None,
    copy=False,
    name=None,
    verify_integrity: bool = True,
    _set_identity: bool = True,
)
Docstring:
A multi-level, or hierarchical, index object for pandas objects.

Parameters
----------
levels : sequence of arrays
    The unique labels for each level.
codes : sequence of arrays
    Integers for each level designating which label at each location.

    .. versionadded:: 0.24.0
sortorder : optional int
    Level of sortedness (must be lexicographically sorted by that
    level).
names : optional sequence of objects
    Names for each of the index levels. (name is accepted for compat).
copy : bool, default False
    Copy the meta-data.
verify_integrity : bool, default True
    Check that the levels/codes are consistent and valid.

Attributes
----------
names
levels
codes
nlevels
levshape

Methods
-------
from_arrays
from_tuples
from_product
from_frame
set_levels
set_codes
to_frame
to_flat_index
is_lexsorted
sortlevel
droplevel
swaplevel
reorder_levels
remove_unused_levels
get_locs

See Also
--------
MultiIndex.from_arrays  : Convert list of arrays to MultiIndex.
MultiIndex.from_product : Create a MultiIndex from the cartesian product
                          of iterables.
MultiIndex.from_tuples  : Convert list of tuples to a MultiIndex.
MultiIndex.from_frame   : Make a MultiIndex from a DataFrame.
Index : The base pandas Index type.

Notes
-----
See the `user guide
<https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html>`_
for more.

Examples
--------
A new ``MultiIndex`` is typically constructed using one of the helper
methods :meth:`MultiIndex.from_arrays`, :meth:`MultiIndex.from_product`
and :meth:`MultiIndex.from_tuples`. For example (using ``.from_arrays``):

>>> arrays = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]
>>> pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))
MultiIndex([(1,  'red'),
            (1, 'blue'),
            (2,  'red'),
            (2, 'blue')],
           names=['number', 'color'])

See further examples for how to construct a MultiIndex in the doc strings
of the mentioned helper methods.
File:           /usr/lib/python3/dist-packages/pandas/core/indexes/multi.py
Type:           type
Subclasses:

In [182]:
df3

NameError: name 'df3' is not defined

In [183]:
ser3

first   up        0.094665
        down      0.288364
        centre    0.654265
second  up        0.250094
        down      0.389019
        centre    0.402110
third   up        0.811684
        down      0.735796
        centre    0.931845
fourth  up        0.803075
        down      0.782089
        centre    0.971210
dtype: float64

In [184]:
ser3['first']

up        0.094665
down      0.288364
centre    0.654265
dtype: float64

In [186]:
ser3[:,'centre']

first     0.654265
second    0.402110
third     0.931845
fourth    0.971210
dtype: float64

In [187]:
ser3['second','down']

0.38901900309746085

In [188]:
ser3.unstack?

Signature: ser3.unstack(level=-1, fill_value=None)
Docstring:
Unstack, also known as pivot, Series with MultiIndex to produce DataFrame.

Parameters
----------
level : int, str, or list of these, default last level
    Level(s) to unstack, can pass level name.
fill_value : scalar value, default None
    Value to use when replacing NaN values.

Returns
-------
DataFrame
    Unstacked Series.

Examples
--------
>>> s = pd.Series([1, 2, 3, 4],
...               index=pd.MultiIndex.from_product([['one', 'two'],
...                                                 ['a', 'b']]))
>>> s
one  a    1
     b    2
two  a    3
     b    4
dtype: int64

>>> s.unstack(level=-1)
     a  b
one  1  2
two  3  4

>>> s.unstack(level=0)
   one  two
a    1    3
b    2    4
File:      /usr/lib/python3/dist-packages/pandas/core/series.py
Type:      method

In [189]:
ser3.unstack()

          centre      down        up
first   0.654265  0.288364  0.094665
fourth  0.971210  0.782089  0.803075
second  0.402110  0.389019  0.250094
third   0.931845  0.735796  0.811684

In [190]:
ser3

first   up        0.094665
        down      0.288364
        centre    0.654265
second  up        0.250094
        down      0.389019
        centre    0.402110
third   up        0.811684
        down      0.735796
        centre    0.931845
fourth  up        0.803075
        down      0.782089
        centre    0.971210
dtype: float64

In [191]:
ser3.unstack(level=0)

           first    fourth    second     third
centre  0.654265  0.971210  0.402110  0.931845
down    0.288364  0.782089  0.389019  0.735796
up      0.094665  0.803075  0.250094  0.811684

In [194]:
ser3.unstack(level=1)

          centre      down        up
first   0.654265  0.288364  0.094665
fourth  0.971210  0.782089  0.803075
second  0.402110  0.389019  0.250094
third   0.931845  0.735796  0.811684

In [195]:
df3=ser3.unstack(level=1)

In [196]:
df3

          centre      down        up
first   0.654265  0.288364  0.094665
fourth  0.971210  0.782089  0.803075
second  0.402110  0.389019  0.250094
third   0.931845  0.735796  0.811684

In [197]:
df3.stack?

Signature: df3.stack(level=-1, dropna=True)
Docstring:
Stack the prescribed level(s) from columns to index.

Return a reshaped DataFrame or Series having a multi-level
index with one or more new inner-most levels compared to the current
DataFrame. The new inner-most levels are created by pivoting the
columns of the current dataframe:

  - if the columns have a single level, the output is a Series;
  - if the columns have multiple levels, the new index
    level(s) is (are) taken from the prescribed level(s) and
    the output is a DataFrame.

Parameters
----------
level : int, str, list, default -1
    Level(s) to stack from the column axis onto the index
    axis, defined as one index or label, or a list of indices
    or labels.
dropna : bool, default True
    Whether to drop rows in the resulting Frame/Series with
    missing values. Stacking a column level onto the index
    axis can create combinations of index and column values
    that are missing from the original dataframe. See Examples
    section.

Returns
-------
DataFrame or Series
    Stacked dataframe or series.

See Also
--------
DataFrame.unstack : Unstack prescribed level(s) from index axis
     onto column axis.
DataFrame.pivot : Reshape dataframe from long format to wide
     format.
DataFrame.pivot_table : Create a spreadsheet-style pivot table
     as a DataFrame.

Notes
-----
The function is named by analogy with a collection of books
being reorganized from being side by side on a horizontal
position (the columns of the dataframe) to being stacked
vertically on top of each other (in the index of the
dataframe).

Examples
--------
**Single level columns**

>>> df_single_level_cols = pd.DataFrame([[0, 1], [2, 3]],
...                                     index=['cat', 'dog'],
...                                     columns=['weight', 'height'])

Stacking a dataframe with a single level column axis returns a Series:

>>> df_single_level_cols
     weight height
cat       0      1
dog       2      3
>>> df_single_level_cols.stack()
cat  weight    0
     height    1
dog  weight    2
     height    3
dtype: int64

**Multi level columns: simple case**

>>> multicol1 = pd.MultiIndex.from_tuples([('weight', 'kg'),
...                                        ('weight', 'pounds')])
>>> df_multi_level_cols1 = pd.DataFrame([[1, 2], [2, 4]],
...                                     index=['cat', 'dog'],
...                                     columns=multicol1)

Stacking a dataframe with a multi-level column axis:

>>> df_multi_level_cols1
     weight
         kg    pounds
cat       1        2
dog       2        4
>>> df_multi_level_cols1.stack()
            weight
cat kg           1
    pounds       2
dog kg           2
    pounds       4

**Missing values**

>>> multicol2 = pd.MultiIndex.from_tuples([('weight', 'kg'),
...                                        ('height', 'm')])
>>> df_multi_level_cols2 = pd.DataFrame([[1.0, 2.0], [3.0, 4.0]],
...                                     index=['cat', 'dog'],
...                                     columns=multicol2)

It is common to have missing values when stacking a dataframe
with multi-level columns, as the stacked dataframe typically
has more values than the original dataframe. Missing values
are filled with NaNs:

>>> df_multi_level_cols2
    weight height
        kg      m
cat    1.0    2.0
dog    3.0    4.0
>>> df_multi_level_cols2.stack()
        height  weight
cat kg     NaN     1.0
    m      2.0     NaN
dog kg     NaN     3.0
    m      4.0     NaN

**Prescribing the level(s) to be stacked**

The first parameter controls which level or levels are stacked:

>>> df_multi_level_cols2.stack(0)
             kg    m
cat height  NaN  2.0
    weight  1.0  NaN
dog height  NaN  4.0
    weight  3.0  NaN
>>> df_multi_level_cols2.stack([0, 1])
cat  height  m     2.0
     weight  kg    1.0
dog  height  m     4.0
     weight  kg    3.0
dtype: float64

**Dropping missing values**

>>> df_multi_level_cols3 = pd.DataFrame([[None, 1.0], [2.0, 3.0]],
...                                     index=['cat', 'dog'],
...                                     columns=multicol2)

Note that rows where all values are missing are dropped by
default but this behaviour can be controlled via the dropna
keyword parameter:

>>> df_multi_level_cols3
    weight height
        kg      m
cat    NaN    1.0
dog    2.0    3.0
>>> df_multi_level_cols3.stack(dropna=False)
        height  weight
cat kg     NaN     NaN
    m      1.0     NaN
dog kg     NaN     2.0
    m      3.0     NaN
>>> df_multi_level_cols3.stack(dropna=True)
        height  weight
cat m      1.0     NaN
dog kg     NaN     2.0
    m      3.0     NaN
File:      /usr/lib/python3/dist-packages/pandas/core/frame.py
Type:      method

In [198]:
df3.stack()

first   centre    0.654265
        down      0.288364
        up        0.094665
fourth  centre    0.971210
        down      0.782089
        up        0.803075
second  centre    0.402110
        down      0.389019
        up        0.250094
third   centre    0.931845
        down      0.735796
        up        0.811684
dtype: float64

In [199]:
df3

          centre      down        up
first   0.654265  0.288364  0.094665
fourth  0.971210  0.782089  0.803075
second  0.402110  0.389019  0.250094
third   0.931845  0.735796  0.811684

In [205]:
df3.stack(-1)

first   centre    0.654265
        down      0.288364
        up        0.094665
fourth  centre    0.971210
        down      0.782089
        up        0.803075
second  centre    0.402110
        down      0.389019
        up        0.250094
third   centre    0.931845
        down      0.735796
        up        0.811684
dtype: float64

In [206]:
ser3

first   up        0.094665
        down      0.288364
        centre    0.654265
second  up        0.250094
        down      0.389019
        centre    0.402110
third   up        0.811684
        down      0.735796
        centre    0.931845
fourth  up        0.803075
        down      0.782089
        centre    0.971210
dtype: float64

In [207]:
df4=ser3.unstack(level=0)

In [208]:
df4

           first    fourth    second     third
centre  0.654265  0.971210  0.402110  0.931845
down    0.288364  0.782089  0.389019  0.735796
up      0.094665  0.803075  0.250094  0.811684

In [209]:
df3

          centre      down        up
first   0.654265  0.288364  0.094665
fourth  0.971210  0.782089  0.803075
second  0.402110  0.389019  0.250094
third   0.931845  0.735796  0.811684

In [210]:
df4.stack()

centre  first     0.654265
        fourth    0.971210
        second    0.402110
        third     0.931845
down    first     0.288364
        fourth    0.782089
        second    0.389019
        third     0.735796
up      first     0.094665
        fourth    0.803075
        second    0.250094
        third     0.811684
dtype: float64

In [212]:
df=pd.DataFrame(np.arange(16).reshape(4,4),index=[['one','one','two','two'],[1,2,1,2]],columns=[['col1','col1','col2','col2'],[1,2,1,2]],dtype='int32')

In [213]:
df

      col1     col2
         1   2    1   2
one 1    0   1    2   3
    2    4   5    6   7
two 1    8   9   10  11
    2   12  13   14  15

In [214]:
df.index

MultiIndex([('one', 1),
            ('one', 2),
            ('two', 1),
            ('two', 2)],
           )

In [215]:
df.columns

MultiIndex([('col1', 1),
            ('col1', 2),
            ('col2', 1),
            ('col2', 2)],
           )

In [216]:
df.index.names=['L1','L2']

In [217]:
df.columns.names=['C1','C2']

In [218]:
df

C1     col1     col2
C2        1   2    1   2
L1  L2
one 1     0   1    2   3
    2     4   5    6   7
two 1     8   9   10  11
    2    12  13   14  15

In [219]:
df.swaplevel('L1','L2')

C1     col1     col2
C2        1   2    1   2
L2 L1
1  one    0   1    2   3
2  one    4   5    6   7
1  two    8   9   10  11
2  two   12  13   14  15

In [220]:
df.swapaxes()

TypeError: swapaxes() missing 2 required positional arguments: 'axis1' and 'axis2'

In [221]:
df.swaplevel?

Signature: df.swaplevel(i=-2, j=-1, axis=0) -> 'DataFrame'
Docstring:
Swap levels i and j in a MultiIndex on a particular axis.

Parameters
----------
i, j : int or str
    Levels of the indices to be swapped. Can pass level name as string.
axis : {0 or 'index', 1 or 'columns'}, default 0
    The axis to swap levels on. 0 or 'index' for row-wise, 1 or
    'columns' for column-wise.

Returns
-------
DataFrame
File:      /usr/lib/python3/dist-packages/pandas/core/frame.py
Type:      method

In [223]:
df.swaplevel(axis=1,i='C1',j='C2')

C2        1    2    1    2
C1     col1 col1 col2 col2
L1  L2
one 1     0    1    2    3
    2     4    5    6    7
two 1     8    9   10   11
    2    12   13   14   15

In [224]:
df

C1     col1     col2
C2        1   2    1   2
L1  L2
one 1     0   1    2   3
    2     4   5    6   7
two 1     8   9   10  11
    2    12  13   14  15

In [225]:
df.swapaxes?

Signature: df.swapaxes(axis1, axis2, copy=True) -> ~FrameOrSeries
Docstring:
Interchange axes and swap values axes appropriately.

Returns
-------
y : same as input
File:      /usr/lib/python3/dist-packages/pandas/core/generic.py
Type:      method

In [227]:
df.swapaxes(axis1=0,axis2=1)

L1      one    two
L2        1  2   1   2
C1   C2
col1 1    0  4   8  12
     2    1  5   9  13
col2 1    2  6  10  14
     2    3  7  11  15

In [228]:
df

C1     col1     col2
C2        1   2    1   2
L1  L2
one 1     0   1    2   3
    2     4   5    6   7
two 1     8   9   10  11
    2    12  13   14  15

In [229]:
df.sum(level='L2')

C1 col1     col2
C2    1   2    1   2
L2
1     8  10   12  14
2    16  18   20  22

In [230]:
df.sum(level='C1',axis=1)

C1      col1  col2
L1  L2
one 1      1     5
    2      9    13
two 1     17    21
    2     25    29

In [231]:
df

C1     col1     col2
C2        1   2    1   2
L1  L2
one 1     0   1    2   3
    2     4   5    6   7
two 1     8   9   10  11
    2    12  13   14  15

In [233]:
df.index

MultiIndex([('one', 1),
            ('one', 2),
            ('two', 1),
            ('two', 2)],
           names=['L1', 'L2'])

In [234]:
df.columns

MultiIndex([('col1', 1),
            ('col1', 2),
            ('col2', 1),
            ('col2', 2)],
           names=['C1', 'C2'])

In [235]:
df.cummin()

C1     col1    col2
C2        1  2    1  2
L1  L2
one 1     0  1    2  3
    2     0  1    2  3
two 1     0  1    2  3
    2     0  1    2  3

In [236]:
df.describe()

C1          col1                  col2
C2             1          2          1          2
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [237]:
df.value_counts?

Signature:
df.value_counts(
    subset: Optional[Sequence[Optional[Hashable]]] = None,
    normalize: bool = False,
    sort: bool = True,
    ascending: bool = False,
)
Docstring:
Return a Series containing counts of unique rows in the DataFrame.

.. versionadded:: 1.1.0

Parameters
----------
subset : list-like, optional
    Columns to use when counting unique combinations.
normalize : bool, default False
    Return proportions rather than frequencies.
sort : bool, default True
    Sort by frequencies.
ascending : bool, default False
    Sort in ascending order.

Returns
-------
Series

See Also
--------
Series.value_counts: Equivalent method on Series.

Notes
-----
The returned Series will have a MultiIndex with one level per input
column. By default, rows that contain any NA values are omitted from
the result. By default, the resulting Series will be in descending
order so that the first element is the most frequently-occurring row.

Examples
--------
>>> df = pd.DataFrame({'num_legs': [2, 4, 4, 6],
...                    'num_wings': [2, 0, 0, 0]},
...                   index=['falcon', 'dog', 'cat', 'ant'])
>>> df
        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

>>> df.value_counts()
num_legs  num_wings
4         0            2
6         0            1
2         2            1
dtype: int64

>>> df.value_counts(sort=False)
num_legs  num_wings
2         2            1
4         0            2
6         0            1
dtype: int64

>>> df.value_counts(ascending=True)
num_legs  num_wings
2         2            1
6         0            1
4         0            2
dtype: int64

>>> df.value_counts(normalize=True)
num_legs  num_wings
4         0            0.50
6         0            0.25
2         2            0.25
dtype: float64
File:      /usr/lib/python3/dist-packages/pandas/core/frame.py
Type:      method

In [238]:
df.value_counts()

(col1, 1)  (col1, 2)  (col2, 1)  (col2, 2)
12         13         14         15           1
8          9          10         11           1
4          5          6          7            1
0          1          2          3            1
dtype: int64

In [241]:
df.value_counts(normalize=False,ascending=True)

(col1, 1)  (col1, 2)  (col2, 1)  (col2, 2)
0          1          2          3            1
4          5          6          7            1
8          9          10         11           1
12         13         14         15           1
dtype: int64

In [242]:
df

C1     col1     col2
C2        1   2    1   2
L1  L2
one 1     0   1    2   3
    2     4   5    6   7
two 1     8   9   10  11
    2    12  13   14  15

In [244]:
df.dtypes

C1    C2
col1  1     int32
      2     int32
col2  1     int32
      2     int32
dtype: object

In [245]:
df.ndim

2

In [246]:
df.shape

(4, 4)

In [247]:
df.size

16

In [249]:
df.transpose()

L1      one    two
L2        1  2   1   2
C1   C2
col1 1    0  4   8  12
     2    1  5   9  13
col2 1    2  6  10  14
     2    3  7  11  15